<?php
// define.php
// デバッグモード
define('DEBUG_MODE',false);

// 固定値
define('ROLE_ADMIN', 1);  // 管理者権限
define('MEMBER_TABLE_STR',     'member');                 // 会員情報のテーブル名
define('MEMBER_CODE_STR',      'member_code');            // 会員情報テーブルの本人会員番号(6桁)　カラム名
define('MEMBER_NAME_STR',      'name');                   // 会員情報テーブルの本人登録名　カラム名
define('MEMBER_NAME_KANA_STR', 'name_kana');              // 会員情報テーブルの本人登録名ふりがな　カラム名
define('MEMBER_TITLE_STR',     'name_title');             // 会員情報テーブルの本人敬称　カラム名
define('MEMBER_TYPE_STR',      'type');                   // 会員情報テーブルの本人種別　カラム名
define('MEMBER_CLASS_STR',     'class');                  // 会員情報テーブルの本人クラス　カラム名
define('EVENT_TABLE_STR' ,     'event');                  // イベント情報のテーブル名
define('USER_TABLE_STR',       'user');                   // ログインユーザ情報のテーブル名
define('USER_LOGIN_ID_STR',    'login_id');               // ログインユーザ情報テーブルのログインID　カラム名
define('USER_NAME_STR',        'user_name');              // ログインユーザ情報テーブルのユーザ名　カラム名
define('USER_PASSWORD_STR',    'password');               // ログインユーザ情報テーブルのパスワード名　カラム名
define('USER_ADMIN_STR',       'admin');                  // ログインユーザ情報テーブルの管理者権限　カラム名

// 管理者権限タイトル
define('USER_ROLE', [
    0 => '一般',
    1 => '管理者',
]);

define('TYPE_NAME',[
    1 => 'タイプ1',
    2 => 'タイプ2',
    3 => 'タイプ3',
    4 => 'タイプ4',
]);

define('TYPE_CODE_TO_TYPE_NAME',[
    1 => 'タイプ1',
    2 => 'タイプ2',
    3 => 'タイプ3',
    4 => 'タイプ4',
]);

define('CLASS_NAME',[
    '010' => 'S',
    '020' => 'A',
    '030' => 'B',
    '040' => 'C',
    '050' => 'D',
]);

// 種別=>クラスコード配列
define('TYPE_TO_CLASS_LIST',[
    1 => [
        '1_010',
    ],
    2 => [
        '2_010',
        '2_020',
    ],
    3 => [
        '3_010',
        '3_020',
        '3_030',
    ],
    4 => [
        '4_010',
        '4_020',
        '4_030',
        '4_040',
        '4_050',
    ],
]);

// 都道府県コード=>都道府県名
define('PREF_CODE_TO_PREF_NAME',[
    '01' => '北海道',
    '02' => '青森県',
    '03' => '岩手県',
    '04' => '宮城県',
    '05' => '秋田県',
    '06' => '山形県',
    '07' => '福島県',
    '08' => '茨城県',
    '09' => '栃木県',
    '10' => '群馬県',
    '11' => '埼玉県',
    '12' => '千葉県',
    '13' => '東京都',
    '14' => '神奈川県',
    '15' => '新潟県',
    '16' => '富山県',
    '17' => '石川県',
    '18' => '福井県',
    '19' => '山梨県',
    '20' => '長野県',
    '21' => '岐阜県',
    '22' => '静岡県',
    '23' => '愛知県',
    '24' => '三重県',
    '25' => '滋賀県',
    '26' => '京都府',
    '27' => '大阪府',
    '28' => '兵庫県',
    '29' => '奈良県',
    '30' => '和歌山県',
    '31' => '鳥取県',
    '32' => '島根県',
    '33' => '岡山県',
    '34' => '広島県',
    '35' => '山口県',
    '36' => '徳島県',
    '37' => '香川県',
    '38' => '愛媛県',
    '39' => '高知県',
    '40' => '福岡県',
    '41' => '佐賀県',
    '42' => '長崎県',
    '43' => '熊本県',
    '44' => '大分県',
    '45' => '宮崎県',
    '46' => '鹿児島県',
    '47' => '沖縄県',
    '99' => 'オンライン',
]);

// 都道府県名=>都道府県コード
define('PREF_NAME_TO_PREF_CODE',[
    '北海道'     => '01',
    '青森県'     => '02',
    '岩手県'     => '03',
    '宮城県'     => '04',
    '秋田県'     => '05',
    '山形県'     => '06',
    '福島県'     => '07',
    '茨城県'     => '08',
    '栃木県'     => '09',
    '群馬県'     => '10',
    '埼玉県'     => '11',
    '千葉県'     => '12',
    '東京都'     => '13',
    '神奈川県'   => '14',
    '新潟県'     => '15',
    '富山県'     => '16',
    '石川県'     => '17',
    '福井県'     => '18',
    '山梨県'     => '19',
    '長野県'     => '20',
    '岐阜県'     => '21',
    '静岡県'     => '22',
    '愛知県'     => '23',
    '三重県'     => '24',
    '滋賀県'     => '25',
    '京都府'     => '26',
    '大阪府'     => '27',
    '兵庫県'     => '28',
    '奈良県'     => '29',
    '和歌山県'   => '30',
    '鳥取県'     => '31',
    '島根県'     => '32',
    '岡山県'     => '33',
    '広島県'     => '34',
    '山口県'     => '35',
    '徳島県'     => '36',
    '香川県'     => '37',
    '愛媛県'     => '38',
    '高知県'     => '39',
    '福岡県'     => '40',
    '佐賀県'     => '41',
    '長崎県'     => '42',
    '熊本県'     => '43',
    '大分県'     => '44',
    '宮崎県'     => '45',
    '鹿児島県'   => '46',
    '沖縄県'     => '47',
    'オンライン' => '99',
]);

// 都道府県コード=>ブロックコード
define('PREF_CODE_TO_BLOCK_CODE',[
    '01' => '10',
    '02' => '20',
    '03' => '20',
    '04' => '20',
    '05' => '20',
    '06' => '20',
    '07' => '20',
    '08' => '30',
    '09' => '30',
    '10' => '26',
    '11' => '30',
    '12' => '30',
    '13' => '30',
    '14' => '30',
    '15' => '26',
    '16' => '25',
    '17' => '25',
    '18' => '25',
    '19' => '30',
    '20' => '26',
    '21' => '40',
    '22' => '30',
    '23' => '40',
    '24' => '40',
    '25' => '50',
    '26' => '50',
    '27' => '50',
    '28' => '50',
    '29' => '50',
    '30' => '50',
    '31' => '60',
    '32' => '60',
    '33' => '60',
    '34' => '60',
    '35' => '60',
    '36' => '70',
    '37' => '70',
    '38' => '70',
    '39' => '70',
    '40' => '80',
    '41' => '80',
    '42' => '80',
    '43' => '80',
    '44' => '80',
    '45' => '80',
    '46' => '80',
    '47' => '90',
    '99' => '99',
]);

// 都道府県コード=>ブロック名
define('PREF_CODE_TO_BLOCK_NAME',[
    '01' => '北海道',
    '02' => '東北',
    '03' => '東北',
    '04' => '東北',
    '05' => '東北',
    '06' => '東北',
    '07' => '東北',
    '08' => '関東',
    '09' => '関東',
    '10' => '上信越',
    '11' => '関東',
    '12' => '関東',
    '13' => '関東',
    '14' => '関東',
    '15' => '上信越',
    '16' => '北陸',
    '17' => '北陸',
    '18' => '北陸',
    '19' => '関東',
    '20' => '上信越',
    '21' => '東海',
    '22' => '関東',
    '23' => '東海',
    '24' => '東海',
    '25' => '近畿',
    '26' => '近畿',
    '27' => '近畿',
    '28' => '近畿',
    '29' => '近畿',
    '30' => '近畿',
    '31' => '中国',
    '32' => '中国',
    '33' => '中国',
    '34' => '中国',
    '35' => '中国',
    '36' => '四国',
    '37' => '四国',
    '38' => '四国',
    '39' => '四国',
    '40' => '九州',
    '41' => '九州',
    '42' => '九州',
    '43' => '九州',
    '44' => '九州',
    '45' => '九州',
    '46' => '九州',
    '47' => '沖縄',
    '99' => 'オンライン',
]);

// ブロック=>都道府県コード配列
define('BLOCK_TO_PREF_LIST',[
    '10' => [
        '01',
    ],
    '20' => [
        '02',
        '03',
        '04',
        '05',
        '06',
        '07',
    ],
    '25' => [
        '16',
        '17',
        '18',
    ],
    '26' => [
        '10',
        '15',
        '20',
    ],
    '30' => [
        '08',
        '09',
        '11',
        '12',
        '13',
        '14',
        '19',
        '22',
    ],
    '40' => [
        '21',
        '23',
        '24',
    ],
    '50' => [
        '25',
        '26',
        '27',
        '28',
        '29',
        '30',
    ],
    '60' => [
        '31',
        '32',
        '33',
        '34',
        '35',
    ],
    '70' => [
        '36',
        '37',
        '38',
        '39',
    ],
    '80' => [
        '40',
        '41',
        '42',
        '43',
        '44',
        '45',
        '46',
    ],
    '90' =>  [
        '47',
    ],
    '99' =>  [
        '99',
    ],
]);

// ブロック=>ブロック名
define('BLOCK_CODE_TO_BLOCK_NAME',[
    '10' => '北海道',
    '20' => '東北',
    '25' => '北陸',
    '26' => '上信越',
    '30' => '関東',
    '40' => '東海',
    '50' => '近畿',
    '60' => '中国',
    '70' => '四国',
    '80' => '九州',
    '90' => '沖縄',
    '99' => 'オンライン',
]);


?>